Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The A_HotkeyModifierTimeout variable affects the behavior of the Send function with the hotkey modifiers CTRL, ALT, WIN, and SHIFT.
ja: A_HotkeyModifierTimeout変数は、CTRL、ALT、WIN、SHIFTのホットキー修飾子によるSend関数の動作に影響します。

source: The A_MaxHotkeysPerInterval and A_HotkeyInterval variables control the rate of hotkey activations beyond which a warning dialog will be displayed.
ja: A_MaxHotkeysPerIntervalおよびA_HotkeyInterval変数は、警告ダイアログが表示される以上のホットキー起動率を制御します。

source: The A_MenuMaskKey variable controls which key is used to mask WIN or ALT keyup events.
ja: A_MenuMaskKey変数は、WINまたはALTキーアップイベントをマスクするためにどのキーを使用するかを制御します。

source: The Active Window
ja: アクティブ・ウィンドウ

source: The BS_NOTIFY style is now added automatically as needed for Button, CheckBox and Radio controls.
ja: ボタン、チェックボックス、ラジオコントロールで、必要に応じてBS_NOTIFYスタイルが自動的に追加されるようになりました。

source: The Basics
ja: 基本

source: The Blind mode avoids releasing the modifier keys (Alt, Ctrl, Shift, and Win) if they started out in the down position, unless the modifier is excluded.
ja: ブラインドモードは、修飾キー（Alt、Ctrl、Shift、Win）がダウンポジションでスタートした場合、修飾キーが除外されていない限り、解放を回避する。

source: The Blind mode can be enabled with {Blind}, which gives the script more control by disabling a number of things that are normally done automatically to make things work as expected.
ja: ブラインドモードは{Blind}で有効にすることができ、通常、期待通りに動作させるために自動的に行われる多くのことを無効にすることで、スクリプトをよりコントロールできるようにします。

source: The Blind mode is not completely supported by SendPlay, especially when dealing with the modifier keys (Ctrl, Alt, Shift, and Win).
ja: ブラインドモードは、特に修飾キー（Ctrl、Alt、Shift、Win）を扱う場合、SendPlayで完全にサポートされているわけではありません。

source: The Blind mode is used internally when remapping a key.
ja: ブラインドモードは、キーを再マッピングする際に内部で使用されます。

source: The BlockInput function disables or enables the user's ability to interact with the computer via keyboard and mouse.
ja: BlockInput関数は、ユーザーがキーボードやマウスを使ってコンピュータと対話する機能を無効化または有効化するものです。

source: The BoundFunc acts as an anonymous variadic function with no other formal parameters, similar to the fat arrow function below:
ja: BoundFuncは、以下のファット・アロー関数と同様に、他の正式なパラメーターを持たない無名バリアド関数として機能する：

source: The Break statement exits (terminates) any type of loop statement.
ja: Break文は、あらゆるタイプのループ文から抜け出します（終了します）。

source: The Buffer object encapsulates a block of memory for use with advanced techniques such as DllCall, structures, StrPut and raw file I/O.
ja: Bufferオブジェクトは、DllCall、構造体、StrPut、生のファイルI/Oなどの高度な技術で使用するためのメモリブロックをカプセル化します。

source: The Callback Function's Parameters
ja: コールバック関数のパラメータ

source: The CallbackCreate function creates a machine-code address that when called, redirects the call to a function in the script.
ja: CallbackCreate関数は、呼び出されたときにスクリプト内の関数に呼び出しをリダイレクトするマシンコードアドレスを作成します。

source: The CaretGetPos function retrieves the current position of the caret (text insertion point).
ja: CaretGetPos関数は、キャレット（テキスト挿入点）の現在位置を取得します。

source: The Catch statement specifies the code to execute if a value or error is thrown during execution of a Try statement.
ja: Catch文は、Try文の実行中に値やエラーが投げられた場合に実行するコードを指定します。

source: The Chr function returns the string (usually a single character) corresponding to the character code indicated by the specified number.
ja: Chr関数は、指定された番号で示される文字コードに対応する文字列（通常は1文字）を返すものです。

source: The ClassNN (classname and instance number) of the control, which can be determined via Window Spy.
ja: コントロールのClassNN（クラス名とインスタンス番号）は、Window Spyで確認することができます。

source: The Click function clicks a mouse button at the specified coordinates.
ja: Click関数は、指定した座標でマウスボタンをクリックする関数です。

source: The Click function uses the sending method set by SendMode.
ja: Click関数は、SendModeで設定された送信方式を使用します。

source: The ClipWait function waits until the clipboard contains data.
ja: ClipWait関数は、クリップボードにデータが入るまで待ちます。

source: The ClipboardAll class facilitates saving and restoring everything on the clipboard (such as pictures and formatting).
ja: ClipboardAllクラスは、クリップボード上のすべてのもの（画像や書式など）の保存と復元を容易にします。

source: The ComCall function calls a native COM interface method by index.
ja: ComCall関数は、ネイティブCOMインターフェイスのメソッドをインデックスで呼び出します。

source: The ComObjActive function retrieves a registered COM object.
ja: ComObjActive関数は、登録されているCOMオブジェクトを取得します。

source: The ComObjArray function creates a SafeArray for use with COM.
ja: ComObjArray 関数は、COM で使用する SafeArray を作成します。

source: The ComObjConnect function connects a COM object's event source to the script, enabling events to be handled.
ja: ComObjConnect関数は、COMオブジェクトのイベントソースをスクリプトに接続し、イベントを処理することを可能にします。

source: The ComObjFlags function retrieves or changes flags which control a COM wrapper object's behaviour.
ja: ComObjFlags関数は、COMラッパー・オブジェクトの動作を制御するフラグを取得または変更します。

source: The ComObjFromPtr function wraps a raw IDispatch interface pointer (COM object) for use by the script.
ja: ComObjFromPtr 関数は、スクリプトが使用する生の IDispatch インターフェースポインタ（COM オブジェクト）をラップします。

source: The ComObjFromPtr function wraps a raw IDispatch pointer (COM object) for use by the script.
ja: ComObjFromPtr関数は、スクリプトが使用する生のIDispatchポインター（COMオブジェクト）をラップします。

source: The ComObjGet function returns a reference to an object provided by a COM component.
ja: ComObjGet 関数は、COM コンポーネントが提供するオブジェクトへの参照を返します。

source: The ComObjQuery function queries a COM object for an interface or service.
ja: ComObjQuery関数は、COMオブジェクトにインターフェースやサービスを問い合わせる。

source: The ComObjType function retrieves type information from a COM object.
ja: ComObjType 関数は、COM オブジェクトから型情報を取得します。

source: The ComObjValue function retrieves the value or pointer stored in a COM wrapper object.
ja: ComObjValue 関数は、COM ラッパーオブジェクトに格納されている値またはポインタを取得します。

source: The ComObject function creates a COM object.
ja: ComObject関数は、COMオブジェクトを作成します。

source: The ComValue class wraps a value, SafeArray or COM object for use by the script or for passing to a COM method.
ja: ComValueクラスは、スクリプトで使用する値、SafeArrayまたはCOMオブジェクトをラップし、COMメソッドに渡すためのものです。

source: The ContextMenu and DropFiles events use client coordinates instead of window coordinates (Client is also the default CoordMode in v2).
ja: ContextMenuとDropFilesイベントは、ウィンドウ座標の代わりにクライアント座標を使用します（Clientはv2のデフォルトCoordModeでもあります）。

source: The ContextMenu event can be registered for each control, or for the whole GUI.
ja: ContextMenuイベントは、コントロールごとに、またはGUI全体に対して登録することができます。

source: The Continue statement skips the rest of a loop statement's current iteration and begins a new one.
ja: Continue文は、ループ文の現在の繰り返しの残りをスキップして、新しい繰り返しを開始します。

source: The ControlAddItem function adds the specified string as a new entry at the bottom of a ListBox or ComboBox.
ja: ControlAddItem 関数は、指定された文字列をリストボックスまたはコンボボックスの下部に新規項目として追加します。

source: The ControlChooseIndex function sets the selection in a ListBox, ComboBox or Tab control to be the Nth item.
ja: ControlChooseIndex関数は、ListBox、ComboBox、またはTabコントロールの選択範囲をN番目の項目に設定します。

source: The ControlChooseIndex function sets the selection in a ListBox, ComboBox or Tab control to be the specified entry or tab number.
ja: ControlChooseIndex関数は、リストボックス、コンボボックス、タブコントロールの選択範囲を、指定されたエントリ番号またはタブ番号に設定します。

source: The ControlChooseString function sets the selection in a ListBox or ComboBox to be the first entry whose leading part matches the specified string.
ja: ControlChooseString関数は、リストボックスまたはコンボボックスで、先頭部分が指定した文字列と一致する最初の項目を選択するように設定します。

source: The ControlClick function sends a mouse button or mouse wheel event to a control.
ja: ControlClick関数は、マウスボタンまたはマウスホイールイベントをコントロールに送信します。

source: The ControlDeleteItem function deletes the specified entry number from a ListBox or ComboBox.
ja: ControlDeleteItem関数は、ListBox または ComboBox から指定された項目番号を削除します。

source: The ControlFindItem function returns the entry number of a ListBox or ComboBox that is a complete match for the specified string.
ja: ControlFindItem 関数は、指定した文字列と完全に一致するListBoxまたはComboBoxのエントリ番号を返します。

source: The ControlFocus function sets input focus to a given control on a window.
ja: ControlFocus関数は、ウィンドウ上の指定されたコントロールに入力フォーカスを設定します。

source: The ControlGetChecked function returns a non-zero value if the checkbox or radio button is checked.
ja: ControlGetChecked関数は、チェックボックスまたはラジオボタンがチェックされている場合、0以外の値を返します。

source: The ControlGetChoice function returns the name of the currently selected entry in a ListBox or ComboBox.
ja: ControlGetChoice 関数は、ListBoxまたはComboBoxで現在選択されている項目の名前を返します。

source: The ControlGetClassNN function returns the ClassNN (class name and sequence number) of the specified control.
ja: ControlGetClassNN 関数は、指定されたコントロールの ClassNN（クラス名とシーケンス番号）を返します。

source: The ControlGetEnabled function returns a non-zero value if the specified control is enabled.
ja: ControlGetEnabled関数は、指定されたコントロールが有効のときに0 以外の値を返します。

source: The ControlGetFocus function retrieves which control of the target window has keyboard focus, if any.
ja: ControlGetFocus関数は、ターゲットウィンドウのどのコントロールにキーボードフォーカスがあるか、もしあれば、それを取得します。

source: The ControlGetHwnd function returns the unique ID number of the specified control.
ja: ControlGetHwnd 関数は、指定されたコントロールの固有の ID 番号を返します。

source: The ControlGetIndex function returns the index of the currently selected entry or tab in a ListBox, ComboBox or Tab control.
ja: ControlGetIndex関数は、ListBox、ComboBox、Tabコントロールで現在選択されている項目またはタブのインデックスを返します。

source: The ControlGetItems function returns an array of items/rows from a ListBox, ComboBox, or DropDownList.
ja: ControlGetItems 関数は、ListBox、ComboBox、DropDownList から項目/行の配列を返します。

source: The ControlGetPos function retrieves the position and size of a control.
ja: ControlGetPos関数は、コントロールの位置と大きさを取得します。

source: The ControlGetStyle and ControlGetExStyle functions return an integer representing the style or extended style of the specified control.
ja: ControlGetStyle関数およびControlGetExStyle関数は、指定されたコントロールのスタイルまたは拡張スタイルを表す整数を返します。

source: The ControlGetText function retrieves text from a control.
ja: ControlGetText関数は、コントロールからテキストを取得する関数です。

source: The ControlGetVisible function returns a non-zero value if the specified control is visible.
ja: ControlGetVisible関数は、指定されたコントロールが可視状態であるときに0 以外の値を返します。

source: The ControlHide function hides the specified control.
ja: ControlHide関数は、指定されたコントロールを非表示にします。

source: The ControlHideDropDown function hides the drop-down list of a ComboBox control.
ja: ControlHideDropDown関数は、ComboBoxコントロールのドロップダウンリストを非表示にします。

source: The ControlMove function moves or resizes a control.
ja: ControlMove関数は、コントロールを移動またはサイズ変更します。

source: The ControlSend and ControlSendText functions send simulated keystrokes or text to a window or control.
ja: ControlSendとControlSendText関数は、キーストロークやテキストをシミュレーションしてウィンドウやコントロールに送信します。

source: The ControlSetChecked function turns on (checks) or turns off (unchecks) a checkbox or radio button.
ja: ControlSetChecked関数は、チェックボックスやラジオボタンをオン（チェック）またはオフ（アンチェック）する関数です。

source: The ControlSetEnabled function enables or disables the specified control.
ja: ControlSetEnabled関数は、指定されたコントロールを有効または無効にします。

source: The ControlSetStyle and ControlSetExStyle functions change the style or extended style of the specified control, respectively.
ja: ControlSetStyle関数および ControlSetExStyle関数は、それぞれ指定されたコントロールのスタイルまたは拡張スタイルを変更します。

source: The ControlSetText function changes the text of a control.
ja: ControlSetText関数は、コントロールのテキストを変更します。

source: The ControlShow function shows the specified control if it was previously hidden.
ja: ControlShow関数は、指定されたコントロールが非表示になっている場合、そのコントロールを表示します。

source: The ControlShowDropDown function shows the drop-down list of a ComboBox control.
ja: ControlShowDropDown関数は、ComboBoxコントロールのドロップダウンリストを表示します。

source: The CoordMode function sets coordinate mode for various built-in functions to be relative to either the active window or the screen.
ja: CoordMode関数は、様々な組み込み関数の座標モードを、アクティブウィンドウまたはスクリーンに対する相対座標に設定します。

source: The Critical statement prevents the current thread from being interrupted by other threads, or enables it to be interrupted.
ja: Critical文は、現在のスレッドが他のスレッドによって中断されるのを防いだり、中断されるのを可能にしたりします。

source: The DLL or EXE file name followed by a backslash and the name of the function.
ja: DLLまたはEXEのファイル名の後にバックスラッシュを付け、関数名を指定します。

source: The Dash can be opened via the "AutoHotkey" shortcut in the Start menu.
ja: Dashはスタートメニューの「AutoHotkey」ショートカットから開くことができます。

source: The DateAdd function adds or subtracts time from a date-time value.
ja: DateAdd関数は、日付時刻の値から時間を加算または減算する関数です。

source: The DateDiff function compares two date-time values and returns the difference.
ja: DateDiff関数は、2つの日付時刻の値を比較し、その差を返します。

source: The DebugVars script provides a graphical user interface for inspecting and changing the contents of variables and objects in any running script (except compiled scripts).
ja: DebugVarsスクリプトは、実行中のスクリプト（コンパイル済みスクリプトを除く）の変数やオブジェクトの内容を検査したり変更したりするためのグラフィカルユーザーインターフェイスを提供します。

source: The Desktop is skipped.
ja: デスクトップはスキップされます。

source: The DetectHiddenText function determines whether invisible text in a window is "seen" for the purpose of finding the window.
ja: DetectHiddenText関数は、ウィンドウ内の不可視テキストが、ウィンドウを見つけるために「見える」かどうかを判定します。

source: The DetectHiddenWindows function determines whether invisible windows are "seen" by the script.
ja: DetectHiddenWindows関数は、不可視のウィンドウがスクリプトによって「見える」かどうかを判断します。

source: The DirCopy function copies a folder along with all its sub-folders and files (similar to xcopy).
ja: DirCopy関数は、フォルダをそのすべてのサブフォルダとファイルとともにコピーします（xcopyに似ています）。

source: The DirCreate function creates a folder.
ja: DirCreate関数は、フォルダーを作成します。

source: The DirDelete function deletes a folder.
ja: DirDelete関数は、フォルダーを削除します。

source: The DirExist function checks for the existence of a folder and return its attributes.
ja: DirExist関数は、フォルダの存在を確認し、その属性を返します。

source: The DirMove function moves a folder along with all its sub-folders and files.
ja: DirMove関数は、フォルダをそのすべてのサブフォルダとファイルとともに移動させます。

source: The DirSelect function displays a standard dialog that allows the user to select a folder.
ja: DirSelect関数は、フォルダを選択する標準的なダイアログを表示します。

source: The DllCall function calls a function inside a DLL, such as a standard Windows API function.
ja: DllCall関数は、Windows標準のAPI関数など、DLL内部の関数を呼び出します。

source: The Download function downloads a file from the Internet.
ja: ダウンロード機能は、インターネットからファイルをダウンロードする機能です。

source: The DriveEject and DriveRetract functions eject or retract the tray of the specified CD/DVD drive, or eject a removable drive.
ja: DriveEject、DriveRetractは、指定されたCD/DVDドライブのトレイの取り出しや収納、リムーバブルドライブの取り出しができる機能です。

source: The DriveGetCapacity function returns the total capacity of the drive which contains the specified path, in megabytes.
ja: DriveGetCapacity関数は、指定されたパスを含むドライブの総容量をメガバイト単位で返します。

source: The DriveGetFileSystem function returns the type of the specified drive's file system.
ja: DriveGetFileSystem関数は、指定されたドライブのファイルシステムの種類を返す。

source: The DriveGetLabel function returns the volume label of the specified drive.
ja: DriveGetLabel関数は、指定されたドライブのボリュームラベルを返します。

source: The DriveGetList function returns a string of letters, one character for each drive letter in the system.
ja: DriveGetList関数は、システム内の各ドライブ文字に対して1文字ずつ、文字列を返します。

source: The DriveGetSerial function returns the volume serial number of the specified drive.
ja: DriveGetSerial関数は、指定されたドライブのボリュームシリアル番号を返します。

source: The DriveGetSpaceFree function returns the free disk space of the drive which contains the specified path, in megabytes.
ja: DriveGetSpaceFree 関数は、指定されたパスを含むドライブの空きディスク容量をメガバイト単位で返します。

source: The DriveGetStatus function returns the status of the drive which contains the specified path.
ja: DriveGetStatus関数は、指定されたパスが含まれるドライブのステータスを返します。

source: The DriveGetStatusCD function returns the media status of the specified CD/DVD drive.
ja: DriveGetStatusCD関数は、指定されたCD/DVDドライブのメディアステータスを返します。

source: The DriveGetType function returns the type of the drive which contains the specified path.
ja: DriveGetType関数は、指定されたパスが含まれるドライブのタイプを返します。

source: The DriveLock function prevents the eject feature of the specified drive from working.
ja: DriveLock機能は、指定したドライブのイジェクト機能を動作させないようにする機能です。

source: The DriveSetLabel function changes the volume label of the specified drive.
ja: DriveSetLabel関数は、指定されたドライブのボリュームラベルを変更します。

source: The DriveUnlock function restores the eject feature of the specified drive.
ja: DriveUnlock 関数は、指定されたドライブのイジェクト機能を回復させる。

source: The DropFiles event swaps the FileArray and Ctrl parameters, to be consistent with ContextMenu.
ja: DropFilesイベントは、ContextMenuと整合性を取るために、FileArrayと Ctrlパラメータを入れ替えました。

source: The EXE file is produced using the same custom icon, .bin file and compression setting that were last saved in Method #1 above, or as specified by any relevant compiler directive in the script.
ja: EXEファイルは、上記の方法#1で最後に保存したものと同じカスタムアイコン、.binファイル、圧縮設定、またはスクリプト内の関連するコンパイラディレクティブで指定されたものを使用して作成されます。

source: The Edit function opens the current script for editing in the associated editor.
ja: 編集機能は、現在のスクリプトを開き、関連するエディターで編集できるようにします。

source: The Edit function opens the current script for editing in the default editor.
ja: Edit 関数は現在のスクリプトをデフォルトのエディターで開きます。

source: The Edit function opens the current script for editing using the associated "edit" verb in the registry (or Notepad if no verb).
ja: Edit機能は、レジストリの関連する「edit」動詞（動詞がない場合はメモ帳）を使用して編集するために、現在のスクリプトを開きます。ただし、エディターウィンドウにスクリプトがすでに開かれているように見える場合（ウィンドウタイトルに基づく）、エディターの新しいインスタンスを開くのではなく、そのウィンドウが起動されます。

source: The EditGetCurrentCol function returns the column number in an Edit control where the caret (text insertion point) resides.
ja: EditGetCurrentCol関数は、Edit コントロールのキャレット（テキスト挿入点）が存在するカラム番号を返します。

source: The EditGetCurrentLine function returns the line number in an Edit control where the caret (text insert point) resides.
ja: EditGetCurrentLine関数は、Editコントロールのキャレット（テキスト挿入点）が存在する行番号を返します。

source: The EditGetLine function returns the text of the specified line in an Edit control.
ja: EditGetLine関数は、Edit コントロール内の指定された行のテキストを返します。

source: The EditGetLineCount function returns the number of lines in an Edit control.
ja: EditGetLineCount関数は、Editコントロールの行数を返します。

source: The EditGetSelectedText function returns the selected text in an Edit control.
ja: EditGetSelectedText関数は、Edit コントロールで選択されているテキストを返します。

source: The EditPaste function pastes the specified string at the caret (text insertion point) in an Edit control.
ja: EditPaste関数は、エディットコントロールのキャレット（テキストの挿入位置）に指定された文字列を貼り付けます。

source: The Else statement specifies one or more statements to execute if an If statement evaluates to false.
ja: Else文は、If文がfalseと評価された場合に実行する1つまたは複数の文を指定します。

source: The EnvGet function retrieves an environment variable.
ja: EnvGet関数は、環境変数を取得する関数です。

source: The EnvGet function retrieves the value of the specified environment variable.
ja: EnvGet関数は、指定された環境変数を取得します。

source: The EnvSet function writes a value to a variable contained in the environment.
ja: EnvSet関数は、環境に含まれる変数に値を書き込む関数です。

source: The EnvSet function writes a value to the specified environment variable.
ja: EnvSet関数は、指定した環境変数に値を設定します。

source: The Exit function exits the current thread.
ja: Exit関数は、現在のスレッドを終了させる関数です。

source: The Exit function terminates only the current thread.
ja: Exit関数は、現在のスレッドのみを終了させます。

source: The ExitApp function terminates the script.
ja: ExitApp関数は、スクリプトを終了させます。

source: The Explorer taskbar may be hidden/shown as follows:
ja: エクスプローラー・タスクバーは、以下のように表示／非表示を切り替えることができる：

source: The FileAppend function writes text or binary data to the end of a file (first creating the file, if necessary).
ja: FileAppend関数は、テキストまたはバイナリデータをファイルの末尾に書き込みます（必要であれば、最初にファイルを作成します）。

source: The FileCopy function copies one or more files.
ja: FileCopy 関数は、1 つまたは複数のファイルをコピーします。

source: The FileCreateShortcut function creates a shortcut (.lnk) file.
ja: FileCreateShortcut関数は、ショートカット（.lnk）ファイルを作成します。

source: The FileDelete function deletes one or more files permanently.
ja: FileDelete関数はごみ箱に残さずファイルを削除します。

source: The FileDelete function deletes one or more files.
ja: FileDelete 関数は、1つまたは複数のファイルを削除します。

source: The FileEncoding function sets the default encoding for FileRead, FileReadLine, Loop Read, FileAppend, and FileOpen.
ja: FileEncoding 関数は、FileRead、FileReadLine、Loop Read、FileAppend、FileOpen のデフォルトエンコーディングを設定します。

source: The FileEncoding function sets the default encoding for FileRead, Loop Read, FileAppend, and FileOpen.
ja: The FileEncoding関数は、FileRead関数、 Loop Read文、 FileAppend関数とFileOpen関数のエンコード方法の初期値を設定します。

source: The FileExist function checks for the existence of a file or folder and returns its attributes.
ja: FileExist 関数は、ファイルまたはフォルダの存在を確認し、その属性を返します。

source: The FileGetAttrib function reports whether a file or folder is read-only, hidden, etc.
ja: FileGetAttrib関数は、ファイルやフォルダーが読み取り専用かどうか、非表示かどうかなどを報告します。

source: The FileGetShortcut function retrieves information about a shortcut (.lnk) file, such as its target file.
ja: FileGetShortcut関数は、ショートカット（.lnk）ファイルのターゲットファイルなどの情報を取得します。

source: The FileGetSize function retrieves the size of a file.
ja: FileGetSize 関数は、ファイルのサイズを取得します。

source: The FileGetTime function retrieves the datetime stamp of a file or folder.
ja: FileGetTime関数は、ファイルまたはフォルダのタイムスタンプ（日付）を取得します。

source: The FileGetVersion function retrieves the version of a file.
ja: FileGetVersion 関数は、ファイルのバージョンを取得します。

source: The FileInstall function includes the specified file inside the compiled version of the script.
ja: FileInstall 関数は、指定されたファイルをコンパイルされたバージョンのスクリプトの中に含めます。

source: The FileMove function moves or renames one or more files.
ja: FileMove 機能は、1 つまたは複数のファイルを移動または名前変更する機能です。

source: The FileOpen function opens a file to read specific content from it and/or to write new content into it.
ja: FileOpen 関数は、ファイルを開いて特定のコンテンツを読み込んだり、新しいコンテンツを書き込んだりすることができます。

source: The FileRead function retrieves the contents of a file.
ja: FileRead 関数は、ファイルの内容を取得します。

source: The FileRecycle function sends a file or directory to the recycle bin if possible, or permanently deletes it.
ja: FileRecycle関数は、ファイルやディレクトリを可能な限りごみ箱に送ったり、永久に削除したりします。

source: The FileRecycleEmpty function empties the recycle bin.
ja: FileRecycleEmpty 関数は、ごみ箱を空にする関数です。

source: The FileSelect function displays a standard dialog that allows the user to open or save file(s).
ja: FileSelect関数は、ファイルを開いたり保存したりするための標準的なダイアログを表示します。

source: The FileSetAttrib function changes the attributes of one or more files or folders.
ja: FileSetAttrib関数は、1つまたは複数のファイルまたはフォルダの属性を変更します。

source: The FileSetTime function changes the datetime stamp of one or more files or folders.
ja: FileSetTime 関数は、1つまたは複数のファイルまたはフォルダのタイムスタンプを変更します。

source: The Finally statement ensures that one or more statements are always executed after a Try statement finishes.
ja: Finally文は、Try文が終了した後、必ず1つ以上の文が実行されるようにします。

source: The Float function converts a numeric string or integer value to a floating-point number.
ja: Float関数は、数値文字列または整数を浮動小数点数に変換する関数です。

source: The For loop statement repeats a series of code lines once for each key-value pair in an object.
ja: Forループ文は、オブジェクトのキーと値のペアごとに、一連のコード行を1回ずつ繰り返します。

source: The Format function formats a variable number of input values according to a format string.
ja: Format関数は、フォーマット文字列に従って、可変数の入力値をフォーマットします。

source: The FormatTime function transforms a YYYYMMDDHH24MISS timestamp into the specified date/time format.
ja: FormatTime 関数は、YYYYMMDDHH24MISS のタイムスタンプを指定された日付/時刻形式に変換します。

source: The Func object provides an interface for a function to retrieve values, such as the number of parameters, or to perform actions, such as calling.
ja: Func オブジェクトは、関数がパラメータの数などの値を取得したり、呼び出しなどのアクションを実行するためのインターフェイスを提供します。

source: The Func object represents a user-defined or built-in function and provides an interface to call it, bind parameters to it, and retrieve information about it or its parameters.
ja: Funcオブジェクトは、ユーザー定義または組み込み関数を表し、それを呼び出し、パラメータをバインドし、それやそのパラメータに関する情報を取得するためのインターフェースを提供します。

source: The Function's Parameters
ja: 関数のパラメータ

source: The GUI window is automatically destroyed when the Gui object is deleted, which occurs when its reference count reaches zero.
ja: GUIウィンドウは、Guiオブジェクトが削除されたとき（参照カウントがゼロになったとき）に、自動的に破棄されます。
